In [564]:
import ds_utils
import pandas as pd
df = pd.read_csv('train.csv')

y = df['Survived']
df = df.drop(columns=['Survived'])

train_num = len(df)
df = pd.concat((df, pd.read_csv('test.csv')))

In [565]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [566]:
df['Name'].head(10)

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [567]:
df['LastName'] = df['Name'].apply(lambda x: x.split(',')[0])

In [568]:
df['LastName'].head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: LastName, dtype: object

In [569]:
df['TicketDigits'] = df['Ticket'].apply(lambda x: x.split()[1] if len(x.split()) > 1 else x)

In [570]:
df['Title'] = df['Name'].apply(lambda x: x.split(',')[1].split('.')[0])

In [571]:
df['Title'].head()

0       Mr
1      Mrs
2     Miss
3      Mrs
4       Mr
Name: Title, dtype: object

In [572]:
df['FirstName'] = df['Name'].apply(lambda x: x.split(',')[1].split('.')[1].split(' ')[1])

In [573]:
df['FirstName'].head()

0       Owen
1       John
2      Laina
3    Jacques
4    William
Name: FirstName, dtype: object

In [574]:
df = df.drop(columns=['Ticket', 'PassengerId', 'Name'])

In [575]:
ds_utils.get_nan_col_proportions(df)

[('Age', 0.20091673032849502),
 ('Fare', 0.0007639419404125286),
 ('Cabin', 0.774637127578304),
 ('Embarked', 0.0015278838808250573)]

In [576]:
df['Cabin'].head(10)

0     NaN
1     C85
2     NaN
3    C123
4     NaN
5     NaN
6     E46
7     NaN
8     NaN
9     NaN
Name: Cabin, dtype: object

In [577]:
import numpy as np
df['Cabin'] = df['Cabin'].fillna(' ') 
df['CabinLetter'] = df.apply(lambda row: ' ' if row['Cabin'] == ' ' else row['Cabin'][0], axis=1)

In [578]:
# df['CabinLetter'].head()

In [579]:
df = df.drop(columns=['Cabin'])

In [580]:
import numpy as np

df['nanAge'] = df.apply(lambda row: 0 if row['Age'] == np.nan else 1, axis=1)
# age = replace_missing_with_ml(df, 'Age')['Age']

df['nanFare'] = df.apply(lambda row: 0 if row['Fare'] == np.nan else 1, axis=1)
# fare = replace_missing_with_ml(df, 'Fare')['Fare']

df['nanEmbarked'] = df.apply(lambda row: 0 if row['Embarked'] == np.nan else 1, axis=1)
# embarked = replace_missing_with_ml(df, 'Embarked', is_classify=True)['Embarked']

# df = df.drop(columns=['CabinLetter'])

df['CabinLetter'] = df['CabinLetter'].replace(to_replace=' ', value=np.nan)

nanCabinLetter = df.apply(lambda row: 0 if row['CabinLetter'] == np.nan else 1, axis=1)
df['CabinLetter'] = df.groupby('Pclass')['CabinLetter'].transform(lambda x: x.fillna(x.mode()[0]))

In [581]:
df['Age'] = df.groupby('Pclass')['Age'].transform(lambda x: x.fillna(x.median()))
df['Fare'] = df.groupby('Pclass')['Fare'].transform(lambda x: x.fillna(x.median()))
df['Embarked'] = df.groupby('Pclass')['Embarked'].transform(lambda x: x.fillna(x.mode()[0]))



# #df['nanAge'] = nanAge
# df['Age'] = age

# #df['nanFare'] = nanFare 
# df['Fare'] = fare

# # df['nanEmbarked'] = nanEmbarked 
# df['Embarked'] = embarked

# # df['nanCabinLetter'] = nanCabinLetter
# # df['CabinLetter'] =cabinLetter

In [582]:
df.head()

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,LastName,TicketDigits,Title,FirstName,CabinLetter,nanAge,nanFare,nanEmbarked
0,3,male,22.0,1,0,7.2500,S,Braund,21171,Mr,Owen,F,1,1,1
1,1,female,38.0,1,0,71.2833,C,Cumings,17599,Mrs,John,C,1,1,1
2,3,female,26.0,0,0,7.9250,S,Heikkinen,3101282,Miss,Laina,F,1,1,1
3,1,female,35.0,1,0,53.1000,S,Futrelle,113803,Mrs,Jacques,C,1,1,1
4,3,male,35.0,0,0,8.0500,S,Allen,373450,Mr,William,F,1,1,1

In [583]:
df.loc[df['TicketDigits'].str[-1] == '.']

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,LastName,TicketDigits,Title,FirstName,CabinLetter,nanAge,nanFare,nanEmbarked
115,3,male,21.0,0,0,7.925,S,Pekoniemi,2.,Mr,Edvard,F,1,1,1
173,3,male,21.0,0,0,7.925,S,Sivola,2.,Mr,Antti,F,1,1,1
243,3,male,22.0,0,0,7.125,S,Maenpaa,2.,Mr,Matti,F,1,1,1
382,3,male,32.0,0,0,7.925,S,Tikkanen,2.,Mr,Juho,F,1,1,1
400,3,male,39.0,0,0,7.925,S,Niskanen,2.,Mr,Juha,F,1,1,1
414,3,male,44.0,0,0,7.925,S,Sundman,2.,Mr,Johan,F,1,1,1
433,3,male,17.0,0,0,7.125,S,Kallio,2.,Mr,Nikolai,F,1,1,1
579,3,male,32.0,0,0,7.925,S,Jussila,2.,Mr,Eiriik,F,1,1,1
590,3,male,35.0,0,0,7.125,S,Rintamaki,2.,Mr,Matti,F,1,1,1
636,3,male,32.0,0,0,7.925,S,Leinonen,2.,Mr,Antti,F,1,1,1
664,3,male,20.0,1,0,7.925,S,Lindqvist,2.,Mr,Eino,F,1,1,1
744,3,male,31.0,0,0,7.925,S,Stranden,2.,Mr,Juho,F,1,1,1
45,3,male,25.0,0,0,7.925,S,Peltomaki,2.,Mr,Nikolai,F,1,1,1
97,3,male,29.0,0,0,7.925,S,Makinen,2.,Mr,Kalle,F,1,1,1
268,3,female,24.0,0,0,8.050,S,Howard,2.,Miss,May,F,1,1,1

In [584]:
df['TicketDigits'] = df['TicketDigits'].apply(lambda x: x if x[-1] != '.' else x[:-1])

In [585]:
df.loc[df['TicketDigits'].str.len() < 5]

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,LastName,TicketDigits,Title,FirstName,CabinLetter,nanAge,nanFare,nanEmbarked
10,3,female,4.00,1,1,16.7000,S,Sandstrom,9549,Miss,Marguerite,G,1,1,1
12,3,male,20.00,0,0,8.0500,S,Saundercock,2151,Mr,William,F,1,1,1
19,3,female,24.00,0,0,7.2250,C,Masselmani,2649,Mrs,Fatima,F,1,1,1
26,3,male,24.00,0,0,7.2250,C,Emir,2631,Mr,Farred,F,1,1,1
36,3,male,24.00,0,0,7.2292,C,Mamee,2677,Mr,Hanna,F,1,1,1
37,3,male,21.00,0,0,8.0500,S,Cann,2152,Mr,Ernest,F,1,1,1
39,3,female,14.00,1,0,11.2417,C,Nicola-Yarred,2651,Miss,Jamila,F,1,1,1
40,3,female,40.00,1,0,9.4750,S,Ahlin,7546,Mrs,Johan,F,1,1,1
43,2,female,3.00,1,2,41.5792,C,Laroche,2123,Miss,Simonne,F,1,1,1
48,3,male,24.00,2,0,21.6792,C,Samaan,2662,Mr,Youssef,F,1,1,1
53,2,female,29.00,1,0,26.0000,S,Faunthorpe,2926,Mrs,Lizzie,F,1,1,1
57,3,male,28.50,0,0,7.2292,C,Novel,2697,Mr,Mansouer,F,1,1,1
59,3,male,11.00,5,2,46.9000,S,Goodwin,2144,Master,William,F,1,1,1
60,3,male,22.00,0,0,7.2292,C,Sirayanian,2669,Mr,Orsen,F,1,1,1
65,3,male,24.00,1,1,15.2458,C,Moubarek,2661,Master,Gerios,F,1,1,1
67,3,male,19.00,0,0,8.1583,S,Crease,3464,Mr,Ernest,F,1,1,1
71,3,female,16.00,5,2,46.9000,S,Goodwin,2144,Miss,Lillian,F,1,1,1
73,3,male,26.00,1,0,14.4542,C,Chronopoulos,2680,Mr,Apostolos,F,1,1,1
74,3,male,32.00,0,0,56.4958,S,Bing,1601,Mr,Lee,F,1,1,1
86,3,male,16.00,1,3,34.3750,S,Ford,6608,Mr,William,F,1,1,1
92,1,male,46.00,1,0,61.1750,S,Chaffee,5734,Mr,Herbert,E,1,1,1
93,3,male,26.00,1,2,20.5750,S,Dean,2315,Mr,Bertram,F,1,1,1
103,3,male,33.00,0,0,8.6542,S,Johansson,7540,Mr,Gustaf,F,1,1,1
111,3,female,14.50,1,0,14.4542,C,Zabour,2665,Miss,Hileni,F,1,1,1
113,3,female,20.00,1,0,9.8250,S,Jussila,4136,Miss,Katriina,F,1,1,1
114,3,female,17.00,0,0,14.4583,C,Attalah,2627,Miss,Malake,F,1,1,1
115,3,male,21.00,0,0,7.9250,S,Pekoniemi,2,Mr,Edvard,F,1,1,1
125,3,male,12.00,1,0,11.2417,C,Nicola-Yarred,2651,Master,Elias,F,1,1,1
128,3,female,24.00,1,1,22.3583,C,Peter,2668,Miss,Anna,F,1,1,1
132,3,female,47.00,1,0,14.5000,S,Robins,3337,Mrs,Alexander,F,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
288,3,male,24.00,0,0,7.2292,C,Mardirosian,2655,Mr,Sarkis,F,1,1,1
289,3,male,24.00,0,0,8.0500,S,Ford,1478,Mr,Arthur,F,1,1,1
292,3,male,24.00,0,0,7.2292,C,Nasr,2652,Mr,Mustafa,F,1,1,1
296,2,female,1.00,1,2,41.5792,C,Laroche,2123,Miss,Louise,F,1,1,1
297,3,male,24.00,2,0,21.6792,C,Samaan,2662,Mr,Hanna,F,1,1,1
302,2,male,43.00,0,1,21.0000,S,Phillips,2,Mr,Escott,F,1,1,1
311,3,male,22.00,0,0,7.2250,C,Vartanian,2658,Mr,David,F,1,1,1
312,3,male,24.00,0,0,7.5750,S,Sadowitz,1588,Mr,Harry,F,1,1,1
321,3,male,25.00,0,0,7.2292,C,Krekorian,2654,Mr,Neshan,F,1,1,1
328,2,male,29.00,1,0,26.0000,S,Clarke,2003,Mr,Charles,F,1,1,1
332,3,male,24.00,0,0,7.2250,C,Thomas,2684,Mr,Tannous,F,1,1,1
333,3,female,19.00,1,1,15.7417,C,Nakid,2653,Mrs,Said,F,1,1,1
337,3,male,39.00,0,2,7.2292,C,Elias,2675,Mr,Joseph,F,1,1,1
339,3,male,24.00,0,0,7.2292,C,Betros,2622,Master,Seman,F,1,1,1
342,3,male,24.00,1,9,69.5500,S,Sage,2343,Mr,John,F,1,1,1
344,3,male,24.00,1,1,14.5000,S,van Billiard,851,Master,James,F,1,1,1
347,3,female,38.00,0,0,7.2292,C,Whabee,2688,Mrs,George,F,1,1,1
354,3,female,0.17,1,2,20.5750,S,Dean,2315,Miss,Elizabeth,F,1,1,1
357,3,male,24.00,0,0,7.8792,S,Lockyer,1222,Mr,Edward,F,1,1,1
360,3,male,14.50,8,2,69.5500,S,Sage,2343,Master,William,F,1,1,1
361,2,female,24.00,1,1,37.0042,C,Mallet,2079,Mrs,Albert,F,1,1,1
365,3,female,24.00,1,9,69.5500,S,Sage,2343,Mrs,John,F,1,1,1
366,3,male,24.00,1,0,14.4583,C,Caram,2689,Mr,Joseph,F,1,1,1
369,2,male,29.00,0,0,13.8583,C,Pallas y Castello,2147,Mr,Emilio,F,1,1,1
378,1,male,55.00,0,0,50.0000,S,Hipkins,680,Mr,William,C,1,1,1
384,2,male,29.00,0,0,12.8750,S,Wheeler,2159,Mr,Edwin,F,1,1,1
392,3,male,13.00,0,2,20.2500,S,Abbott,2673,Master,Eugene,F,1,1,1
405,2,male,20.00,0,0,13.8625,C,Nourney,2166,Mr,Alfred,D,1,1,1
413,3,male,24.00,0,0,8.0500,S,Spector,3236,Mr,Woolf,F,1,1,1
417,3,male,24.00,1,1,22.3583,C,Peter,2668,Master,Michael,F,1,1,1

In [586]:
df['TicketDigits'] = df['TicketDigits'].apply(lambda x: x if x[-1] != '.' else x[:-1])

In [587]:
df.loc[df['TicketDigits'].str[-1] == '.']

Empty DataFrame
Columns: [Pclass, Sex, Age, SibSp, Parch, Fare, Embarked, LastName, TicketDigits, Title, FirstName, CabinLetter, nanAge, nanFare, nanEmbarked]
Index: []

In [588]:
df.loc[df['TicketDigits'] == 'LINE']

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,LastName,TicketDigits,Title,FirstName,CabinLetter,nanAge,nanFare,nanEmbarked
179,3,male,36.0,0,0,0.0,S,Leonard,LINE,Mr,Lionel,F,1,1,1
271,3,male,25.0,0,0,0.0,S,Tornquist,LINE,Mr,William,F,1,1,1
302,3,male,19.0,0,0,0.0,S,Johnson,LINE,Mr,William,F,1,1,1
597,3,male,49.0,0,0,0.0,S,Johnson,LINE,Mr,Alfred,F,1,1,1

In [589]:
df['TicketDigits'] = df['TicketDigits'].apply(lambda x: 1 if x == 'LINE' else x)
df['TicketDigits'] = df['TicketDigits'].apply(lambda x: 1 if x == 'Basle' else x)

In [590]:
df.loc[df['TicketDigits'] == 'LINE']

Empty DataFrame
Columns: [Pclass, Sex, Age, SibSp, Parch, Fare, Embarked, LastName, TicketDigits, Title, FirstName, CabinLetter, nanAge, nanFare, nanEmbarked]
Index: []

In [591]:
df['Title'].unique()

array([' Mr', ' Mrs', ' Miss', ' Master', ' Don', ' Rev', ' Dr', ' Mme',
       ' Ms', ' Major', ' Lady', ' Sir', ' Mlle', ' Col', ' Capt',
       ' the Countess', ' Jonkheer', ' Dona'], dtype=object)

In [592]:
df['Embarked'] = df['Embarked'].astype('category')
df['LastName'] = df['LastName'].astype('category')
df['FirstName'] = df['FirstName'].astype('category')
df['Title'] = df['Title'].astype('category')
df['TicketDigits'] = df['TicketDigits'].astype(int)
df['CabinLetter'] = df['CabinLetter'].astype('category')
df['Sex'] = df['Sex'].astype('category')
# df['isAlone'] =

In [593]:
df2 = df.copy()

In [594]:
df = pd.get_dummies(df)

In [595]:
df.head()

,Pclass,Age,SibSp,Parch,Fare,TicketDigits,nanAge,nanFare,nanEmbarked,Sex_female,...,FirstName_Yousseff,FirstName_of,CabinLetter_A,CabinLetter_B,CabinLetter_C,CabinLetter_D,CabinLetter_E,CabinLetter_F,CabinLetter_G,CabinLetter_T
0,3,22.0,1,0,7.2500,21171,1,1,1,0,...,0,0,0,0,0,0,0,1,0,0
1,1,38.0,1,0,71.2833,17599,1,1,1,1,...,0,0,0,0,1,0,0,0,0,0
2,3,26.0,0,0,7.9250,3101282,1,1,1,1,...,0,0,0,0,0,0,0,1,0,0
3,1,35.0,1,0,53.1000,113803,1,1,1,1,...,0,0,0,0,1,0,0,0,0,0
4,3,35.0,0,0,8.0500,373450,1,1,1,0,...,0,0,0,0,0,0,0,1,0,0

In [596]:
df_train = df[:train_num].copy()
df_train['Survived'] = y
df_test = df[train_num:].copy()

In [597]:
df_train.to_csv('clean_train.csv', index=False)
df_test.to_csv('clean_test.csv', index=False)